{
    "general": "Список команд: help, playlist, play, join, skip, queue, recognize, equal, prefix, vprefix, chat, refresh, draw. Для более подробной справки можно указать другие команды аргументами. Например, >help play или >help equal list",

    "help":
    {
        "general": "Ты ебнулся, зачем тебе помощь по help'у? Эх, ладно, держи: команда-помощник, можно указывать другие команды (в том числе с их аргументами) в качестве аргументов для получения более подробной справки."
    },

    "playlist":
    {
        "general": "Команда для создания, редактирования и запуска плейлистов, возможные аргументы: list, info, create, delete, add, remove, play. Изменять можно лишь свои плейлисты, смотреть информацию и слушать можно любой",
        
        "list": 
        { 
            "general": "Аргумент для получения нумерованного списка созданных плейлистов. Пример: >playlist list" 
        },
        
        "info": 
        { 
            "general": "Аргумент для получения более подробной информации об определенном плейлисте, требует указание номера плейлиста в списке (>playlist info <номер в списке>). Пример: >playlist info 1" 
        },
        
        "create": 
        { 
            "general": "Аргумент для создания плейлиста, требует указания имени (>playlist create <имя плейлиста>). Пример: >playlist create стоны мужиков"
        },
        
        "delete": 
        { 
            "general": "Аргумент для удаления плейлиста, требует указание номера в списке (>playlist delete <номер в списке>). Пример: >playlist delete 1"
        },
        
        "add": 
        { 
            "general": "Аргмуент для добавления трека в плейлист, требует указания номера плейлиста в списке и название добавляемой композиции (>playlist add <номер в списке> <добавляемая композиция>). Пример: >playlist add 1 стон мужика"
        },
        
        "remove": 
        { 
            "general": "Аргумент для удаления трека из плейлиста, требует указание номера алейлиста в списке и номер удаляемого трека (>playlist remove <номер плейлиста> <номер трека>). Пример: >playlist remove 1 1"
        },

        "play":
        {
            "general": "Аргумент для добавления композиций плейлиста в очередь, требует указание номера плейлиста в списке (>playlist play <номер в списке>). Пример: >playlist play 1"
        }
    },

    "join":
    {
        "general": "Команда, применяемая, чтобы бот зашёл в голосовой канал. Если бот используется в другом голосовом канале, то он не перейдёт"
    },

    "play":
    {
        "general": "Команда для добавления композиции в очередь. Если бот не в голосовом канале, то он зайдёт (аналогично join). Аргументами указывается запрос (>play <название композиции>). Пример: >play стон мужика"
    },

    "skip":
    {
        "general": "Команда для пропуска текущей композиции. Используется без аргументов"
    },

    "queue":
    {
        "general": "Команда для просмотра текущей очереди запросов. Используется без аргументов"
    },

    "recognize":
    {
        "general": "Команда для включения/выключения режима голосовых команд. Поддерживается распознование лишь русских слов. Бот считает, что команда вводится после ключевого слова - голосового префикса (vprefix), голосовая команда считается введённой, когда у говорящего пропадает зелёная рамочка. Используется без аргументов"
    },

    "equal":
    {
        "general": "Команда для просмотра и настройки голосовых команд. Используется с аргументами list и set",
        
        "list":
        {
            "general": "Аргумент для просмотра заданных голосовых команд (какую команду заменяет какое русское слово). Пример: >equal list"
        },

        "set":
        {
            "general": "Аргумент для настройки голосовых аналогов, требует указание команды и русского слова, её заменяющего (>equal set <обычная команда> <голосовая команда>). Пример: >equal set play включи"
        }
    },

    "prefix":
    {
        "general": "Команда для изменения префикса, в качестве аргумента принимает новый префикс (>prefix <новый префикс>). Пример: >prefix ="
    },

    "vprefix":
    {
        "general": "Команда для установки голосовго префикса, в качестве аргумента принимает русское слово - новый голосовой префикс (>vprefix <новый префикс>). Пример: >vprefix жаба"
    },

    "chat":
    {
        "general": "Команда для общения с ChatGPT через бота. Для ведения диалога писать обращения после команды. Бот запоминает предыдущие запросы, поэтому возможно ведение полноценного диалога. Пример: >chat Помоги посчитать 2 + 2"
    },

    "refresh":
    {
        "general": "Команда для очистки истории общения с ботом через команду chat. Не требует аргументов для использования (>refresh)."
    },

    "draw":
    {
        "general": "Команда для работы с DALL-E через бота. Может использоваться 2 способами: без изменяемого изображения и с ним. В первом случае просто указывается запрос (>draw девушка на закате в стиле аниме). Во втором случае помимо запроса требуется приложить изменяемое изображение, которое должно быть квадратным, иметь формат PNG и весить не более 4 Мб. Нейросеть будет дорисовывать только прозрачные области."
    }
}